<?php
	$age = $_GET['age'];
	switch ($age) {
		case '1':
			echo '{"span":"您可以直接输入手机号，小满将立即为您查询快件的最新信息","span2":"PS: 目前仅支持中国大陆地区的手机号进行查询"}';
			break;
		case '2':
			echo '{"span":"亲亲``以下方式可以查询到您附近所在的网点喔","span2":"&nbsp;1丶顺丰速运小程序：点“发现”-网点查询"}';
			break;
		case '附近网点在哪':
			echo '{"span":"亲亲``以下方式可以查询到您附近所在的网点喔","span2":"&nbsp;1丶顺丰速运小程序：点发现-网点查询"}';
			break;
		case '手机号查件':
			echo '{"span":"您可以直接输入手机号，小满将立即为您查询快件的最新信息","span2":"PS: 目前仅支持中国大陆地区的手机号进行查询"}';
			break;
		case '3':
			echo '{"span":"请问您从哪座城市寄出呢"}';
			break;
		case '运费时效查询':
			echo '{"span":"请问您从哪座城市寄出呢"}';
			break;
		case '哈哈':
			echo '{"span":"这就是人类的感情吗？小满也要开心一下呢~"}';
            break;
        case '嘻嘻':
			echo '{"span":"这是好事要来的节奏吗？"}';
            break;
        case '你是猪':
			echo '{"span":"猪也有厉害的.猪八戒丶晴天小猪，小满业希望能帮你解决问题的~，"}';
			break;
		case '傻逼':
			echo '{"span":"您发送的信息带有敏感词，丰小满看不懂看不懂，请删除后再发送哦"}';
			break;
		default:
            echo '{"span":"亲！小满没有理解您的意思，要不你换个方式问问吧，如：我要下单丶查运费丶查时效..."}';
			break;
	}
?>